IDEA Open Model
ArcSegment2D Properties
Compatible with IDEA StatiCa v 10.1
The ArcSegment2D type exposes the following members.
Properties
Name | Description
EndPoint
 Gets or sets the endpoint of the segment.
 (Inherited from Segment2D.)
Point
 Gets or sets the point of circular arc somewhere between start and end point.
Top
See Also
Reference
ArcSegment2D Class
IdeaRS.OpenModel.Geometry2D Namespace